Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: དེ་ལྟར་ན་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་རྣམ་པར་དག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the fruit of entering the stream to nirvāṇa, the purity of feelings conditioned by mentally compounded sensory contact [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་རྣམ་པར་དག་པས། གཟུགས་རྣམ་པར་དག་པ།
en: Physical forms are pure owing to the purity of the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment.

source: དེ་ལྟར་ན་རང་བྱང་ཆུབ་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of individual enlightenment [and so forth], the purity of physical forms, and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. [

source: །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་རྣམ་པར་དག་པས། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་བར་དུ་རྣམ་པར་དག་པ་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པས།
en: All phenomena], up to and including feelings conditioned by mentally compounded sensory contact, are pure owing to the purity of the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment.

source: དེ་ལྟར་ན་རང་བྱང་ཆུབ་རྣམ་པར་དག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of individual enlightenment [and so forth], the purity of feelings conditioned by mentally compounded sensory contact [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །ལམ་གྱི་རྣམ་པར་ཤེས་པ་ཉིད་རྣམ་པར་དག་པས། གཟུགས་རྣམ་པར་དག་པ།
en: Physical forms are pure owing to the purity of knowledge of the path.

source: དེ་ལྟར་ན་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་དང་། རྣམ་པར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ། གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of knowledge of the path, the purity of physical forms, and this purity of [all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. [

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་རྣམ་པར་དག་པས། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་བར་དུ་རྣམ་པར་དག་པ།
en: All phenomena], up to and including feelings conditioned by mentally compounded sensory contact, are pure owing to the purity of knowledge of the path.

source: དེ་ལྟར་ན་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་རྣམ་པར་དག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of knowledge of the path, the purity of feelings conditioned by mentally compounded sensory contact [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པས།
en: Physical forms are pure owing to the purity of all-aspect omniscience.

source: དེ་ལྟར་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of all-aspect omniscience, the purity of physical forms, and this purity of [all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པས། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་བར་དུ་རྣམ་པར་དག་པ།
en: All phenomena], up to and including feelings conditioned by mentally compounded sensory contact, are pure owing to the purity of all-aspect omniscience.

source: དེ་ལྟར་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of all-aspect omniscience, the purity of feelings conditioned by mentally compounded sensory contact [and so forth], and this purity of [all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །རབ་འབྱོར་གཞན་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པས། གཟུགས་རྣམ་པར་དག་པ།
en: Moreover, Subhūti, physical forms are pure owing to the purity of all-aspect omniscience.

source: གཟུགས་རྣམ་པར་དག་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་སྟེ།
en: The perfection of wisdom is pure owing to the purity of physical forms.

source: དེ་ལྟར་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of all-aspect omniscience, the purity of physical forms, and this purity of the perfection of wisdom are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པས། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ།
en: Feelings, perceptions, formative predispositions, and consciousness are pure owing to the purity of all-aspect omniscience.

source: རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་སྟེ།
en: The perfection of wisdom is pure owing to the purity of consciousness [and so forth].

source: དེ་ལྟར་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་དང་། རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of all-aspect omniscience, the purity of consciousness [and so forth], and this purity of the perfection of wisdom are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “[

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་སྟེ།
en: The perfection of wisdom is pure owing to the purity of feelings conditioned by mentally compounded sensory contact [and so forth].

source: དེ་ལྟར་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of all-aspect omniscience, the purity of feelings conditioned by mentally compounded sensory contact [and so forth], and this purity of the perfection of wisdom are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པས། གཟུགས་རྣམ་པར་དག་པ།
en: Physical forms are pure owing to the purity of all-aspect omniscience.

source: གཟུགས་རྣམ་པར་དག་པས། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: The perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity are pure owing to the purity of physical forms.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་སྟེ། དེ་ལྟར་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of all-aspect omniscience, the purity of physical forms, and this purity of the perfection of generosity [and so forth] are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “[

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པས། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: The perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity are pure owing to the purity of feelings conditioned by mentally compounded sensory contact [and so forth].

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་སྟེ། དེ་ལྟར་ན་རྣམ་པར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of all-aspect omniscience, the purity of feelings conditioned by mentally compounded sensory contact [and so forth], and this purity of the perfection of generosity [and so forth] are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །རབ་འབྱོར་གཞན་ཡང་འདུས་བྱས་རྣམ་པར་དག་པས།
en: Moreover, Subhūti, unconditioned phenomena are pure owing to the purity of conditioned phenomena. [

source: འདུས་མ་བྱས་རྣམ་པར་དག་པ་སྟེ།
en: Conditioned phenomena are pure owing to the purity of unconditioned phenomena].

source: དེ་ལྟར་ན་འདུས་བྱས་རྣམ་པར་དག་པ་དང་། འདུས་མ་བྱས་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of conditioned phenomena and this purity of unconditioned phenomena are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. {

source: །རབ་འབྱོར་གཞན་ཡང་འདས་པ་རྣམ་པར་དག་པས།
en: Ki.II-III: 159} “Moreover, Subhūti, the future and the present are pure owing to the purity of the past.

source: མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བ་རྣམ་པར་དག་པ་སྟེ། དེ་ལྟར་ན་འདས་པ་རྣམ་པར་དག་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བ་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the past, the purity of the future, and the purity of the present are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །མ་འོངས་པ་རྣམ་པར་དག་པས། འདས་པ་དང་། ད་ལྟར་བྱུང་བ་རྣམ་པར་དག་པ་སྟེ།
en: The past and the present are pure owing to the purity of the future.

source: དེ་ལྟར་ན་མ་འོངས་པ་རྣམ་པར་དག་པ་དང་། འདས་པ་དང་། ད་ལྟར་བྱུང་བ་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the future, and the purity of the past and the present, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །ད་ལྟར་བྱུང་བ་རྣམ་པར་དག་པས། འདས་པ་དང་མ་འོངས་པ་རྣམ་པར་དག་པ་སྟེ།
en: The past and the future are pure owing to the purity of the present.

source: དེ་ལྟར་ན་ད་ལྟར་བྱུང་བ་རྣམ་པར་དག་པ་དང་། འདས་པ་དང་མ་འོངས་པ་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the present, and the purity of the past and the future, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས་སེམས་ཅན་དམྱལ་བའི་ལེའུ་སྟེ། ཉི་ཤུ་དྲུག་པའོ།། །།
en: This completes the twenty-sixth chapter, “The Hells,” from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་འདི་ནི་ཟབ་པོ།
en: Chapter 27: The Purity of All the Dharmas Thereupon the venerable Śāradvatīputra said to the Blessed One, “Blessed Lord, this purity is profound.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར་རོ།
en: That is due to absolute purity,” replied the Blessed One. “

source: །ཤ་ར་དྭ་ཏིའི་བུས་གསོལ་པ་གང་ཤིན་དུ་རྣམ་པར་དག་པའི་སླད་དུ།
en: Due to the absolute purity of what is it that purity is profound?” “

source: རྣམ་པར་དག་པ་ཟབ་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་རྣམ་པར་དག་པའི་ཕྱིར།
en: Śāradvatīputra,” replied the Blessed One, “purity is profound due to the [absolute] purity of physical forms.

source: རྣམ་པར་དག་པ་ཟབ་བོ། །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པའི་ཕྱིར།
en: Purity is profound due to the [absolute] purity of feelings, perceptions, formative predispositions, and consciousness.

source: རྣམ་པར་དག་པ་ཟབ་བོ། །མིག་རྣམ་པར་དག་པའི་ཕྱིར།
en: Purity is profound due to the [absolute] purity of the eyes.

source: རྣམ་པར་དག་པ་ཟབ་བོ། །རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་། ཡིད་རྣམ་པར་དག་པའི་ཕྱིར།
en: Purity is profound due to the [absolute] purity of the ears, nose, tongue, body, and mental faculty.

source: རྣམ་པར་དག་པ་ཟབ་བོ། གཟུགས་རྣམ་པར་དག་པའི་ཕྱིར།
en: Purity is profound due to the [absolute] purity of sights.

source: རྣམ་པར་དག་པ་ཟབ་བོ། །སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་། ཆོས་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་ཟབ་བོ།
en: Purity is profound due to the [absolute] purity of sounds, odors, tastes, tangibles, and mental phenomena.

source: །མིག་གི་རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་ཟབ་བོ།
en: Purity is profound due to the [absolute] purity of visual consciousness.

source: །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པའི་ཕྱིར།
en: Purity is profound due to the [absolute] purity of auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness.

source: རྣམ་པར་དག་པ་ཟབ་བོ། །མིག་གི་འདུས་ཏེ་རེག་པ་རྣམ་པར་དག་པའི་ཕྱིར་རྣམ་པར་དག་པ་ཟབ་བོ།
en: Purity is profound due to the [absolute] purity of visually compounded sensory contact.

source: །རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་རྣམ་པར་དག་པའི་ཕྱིར།
en: Purity is profound due to the [absolute] purity of aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact.

source: རྣམ་པར་དག་པ་ཟབ་བོ། །མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་ཟབ་བོ།
en: Purity is profound due to the [absolute] purity of feelings conditioned by visually compounded sensory contact.

source: །རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པའི་ཕྱིར།
en: Purity is profound due to the [absolute] purity of feelings conditioned by aurally compounded sensory contact, feelings conditioned by nasally compounded sensory contact, feelings conditioned by lingually compounded sensory contact, feelings conditioned by corporeally compounded sensory contact, and feelings conditioned by mentally compounded sensory contact.

source: རྣམ་པར་དག་པ་ཟབ་བོ། །སའི་ཁམས་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་ཟབ་བོ།
en: Purity is profound due to the [absolute] purity of the earth element.

source: །ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་རྣམ་པར་དག་པའི་ཕྱིར།
en: Purity is profound due to the [absolute] purity of the water element, the fire element, the wind element, the space element, and the consciousness element.

source: རྣམ་པར་དག་པ་ཟབ་བོ། །མ་རིག་པ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་ཟབ་བོ།
en: Purity is profound due to the [absolute] purity of ignorance.

source: །འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་། མིང་དང་གཟུགས་དང་། སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་ཚོར་བ་དང་སྲེད་པ་དང་ལེན་པ་དང་སྲིད་པ་དང་སྐྱེ་བ་དང་། རྒ་ཤི་རྣམ་པར་དག་པའི་ཕྱིར་རྣམ་པར་དག་པ་ཟབ་བོ།
en: Purity is profound due to the [absolute] purity of formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་ཟབ་བོ།
en: Purity is profound due to the [absolute] purity of the perfection of generosity.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པའི་ཕྱིར།
en: Purity is profound due to the [absolute] purity of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: རྣམ་པར་དག་པ་ཟབ་བོ། །ནང་སྟོང་པ་ཉིད་རྣམ་པར་དག་པའི་ཕྱིར།
en: Purity is profound due to the [absolute] purity of the emptiness of internal phenomena.

source: རྣམ་པར་དག་པ་ཟབ་བོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་ཟབ་བོ།
en: Purity is profound due to the [absolute] purity of the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་ཟབ་བོ། ཡང་དག་པར་སྤོང་བ་དང་།
en: Purity is profound due to the [absolute] purity of the applications of mindfulness.

source: རྫུ་འཕྲུལ་ཀྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་ཟབ་བོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་།
en: Purity is profound due to the [absolute] purity of the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་ཟབ་བོ།
en: Purity is profound due to the [absolute] purity of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas.

source: །ཐམས་ཅད་ཤེས་པ་ཉིད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་ཟབ་བོ། །གསོལ་བ།
en: Purity is profound due to the [absolute] purity of knowledge of all the dharmas, knowledge of the path, and all-aspect omniscience.”

source: བཅོམ་ལྡན་འདས་རྣམ་པར་དག་པ་ནི་སྣང་བའོ།
en: Śāradvatīputra then said, “Blessed Lord, purity is illuminating.” “

source: །ཤ་ར་དྭ་ཏིའི་བུས་གསོལ་པ།
en: asked Śāradvatīputra. “

source: བཅོམ་ལྡན་འདས་གང་རྣམ་པར་དག་པའི་སླད་དུ། རྣམ་པར་དག་པར་སྣང་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ།
en: Śāradvatīputra,” replied the Blessed One, “purity is illuminating due to the [absolute] purity of physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ།
en: Purity is illuminating due to the [absolute] purity of feelings, perceptions, formative predispositions, and consciousness.

source: །མིག་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ།
en: Purity is illuminating due to the [absolute] purity of the eyes.

source: །རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ།
en: Purity is illuminating due to the [absolute] purity of the ears, nose, tongue, body, and mental faculty.

source: །གཟུགས་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ།
en: Purity is illuminating due to the [absolute] purity of sights.

source: །སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་། ཆོས་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ།
en: Purity is illuminating due to the [absolute] purity of sounds, odors, tastes, tangibles, and mental phenomena.

source: །མིག་གི་རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བ་དོ།
en: Purity is illuminating due to the [absolute] purity of visual consciousness.

source: །རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ།
en: Purity is illuminating due to the [absolute] purity of auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness.

source: །མིག་གི་འདུས་ཏེ་རེག་པ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ། །རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་།
en: Purity is illuminating due to the [absolute] purity of visually compounded sensory contact.

source: སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ།
en: Purity is illuminating due to the [absolute] purity of aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact.

source: །མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ། །རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་པ་དང་།
en: Purity is illuminating due to the [absolute] purity of feelings conditioned by visually compounded sensory contact.

source: ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ།
en: Purity is illuminating due to the [absolute] purity of feelings conditioned by aurally compounded sensory contact, feelings conditioned by nasally compounded sensory contact, feelings conditioned by lingually compounded sensory contact, feelings conditioned by corporeally compounded sensory contact, and feelings conditioned by mentally compounded sensory contact.

source: །སའི་ཁམས་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ། །ཆུའི་ཁམས་དང་།
en: Purity is illuminating due to the [absolute] purity of the earth element.

source: མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ།
en: Purity is illuminating due to the [absolute] purity of the water element, the fire element, the wind element, the space element, and the consciousness element.

source: །མ་རིག་པ་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ། །འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་དང་།
en: Purity is illuminating due to the [absolute] purity of ignorance.

source: མིང་དང་གཟུགས་དང་སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་ཚོར་བ་དང་སྲེད་པ་དང་། ལེན་པ་དང་སྲིད་པ་དང་སྐྱེ་བ་དང་། རྒ་ཤི་རྣམ་པར་དག་པའི་ཕྱིར། རྣམ་པར་དག་པ་སྣང་བའོ།
en: Purity is illuminating due to the [absolute] purity of formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death.
